---
kind: other
id: Properties.T:Autodesk.Revit.DB.CopyPasteOptions
source: html/b309013e-1871-4bd0-b5ea-e5fcff128b5c.htm
---
# CopyPasteOptions Properties

Specifies whether the .NET object represents a valid Revit entity.